"""
Завдання 1. Запустити середовище виконання Python та виконати команду import this.
Оголосити по декілька змінних цілого, дійсного та рядкового типів. Перевірити
виконання арифметичних операцій додавання, віднімання, множення та ділення над
цими змінними, проаналізувати отримані результати. Використати функції print() та
input() для введення і виведення даних. Порівняти особливості синтаксису й
принципи виконання команд у мовах Bash і Python.

"""

import this
print("-" * 20)

int_val = 10
float_val = 5.5
str_val = "Result"

print(f"Додавання: {int_val + float_val}")
print(f"Множення: {int_val * float_val}")

name = input("Введіть ім'я: ")
print(f"Привіт, {name}!")
