"""

Завдання 6. Розробити програму для обчислення факторіала числа з використанням
рекурсивного підходу. Визначити алгоритмічну складність реалізованого методу.

"""

def factorial_recursive(n):
    if n == 0 or n == 1:
        return 1
    else:
        return n * factorial_recursive(n - 1)

try:
    num = int(input("Введіть ціле невід'ємне число: "))

    if num < 0:
        print("Факторіал не визначений для від'ємних чисел.")
    else:
        result = factorial_recursive(num)
        print(f"Факторіал числа {num} дорівнює {result}")
        print("Алгоритмічна складність даного методу: O(n) (лінійна), оскільки кількість викликів функції прямо пропорційна вхідному числу.")

except ValueError:
    print("Помилка: введіть ціле число.")
except RecursionError:
    print("Помилка: число занадто велике, перевищено глибину рекурсії.")
